/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/15 16:04:03 by marvin            #+#    #+#             */
/*   Updated: 2020/01/15 16:04:03 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex11/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_str_is_alpha.c              |
// | Allowed functions: |      Nothing                        |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая возвращает 1, если данная в роли параметра строка содержит только алфавитные символы и 0, если содержить любые другие символы.
//    > Create a function that returns 1 if the string given as a parameter contains only alphabetical characters, and 0 if it contains any other character.
// 2. Here’s how it should be prototyped: int ft_str_is_alpha(char *str)
// 3. Если str пуст, то return 1. // It should return 1 if str is empty

/* -------------------------------------------------------------------------- */
/* Материал                                                                   */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* ft_str_is_alpha                                                            */
/* -------------------------------------------------------------------------- */
int		ft_str_is_alpha(char *str)
{
	int i;

	i = 0;
	while (str[i] != '\0')
	{
		// Если в текущем [i] не будет этих символов при проверке
		if (!(str[i] >= 'a' && str[i] <= 'z')
			&& !(str[i] >= 'A' && str[i] <= 'Z'))
		{
			return (0); // то return 0
		}
		i++;
	}
	return (1);	// else 0 для пустых строк
}