/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c             				                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zanyda <darrnokturna@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/20 17:37:20 by zanyda            #+#    #+#             */
/*   Updated: 2020/01/20 17:37:20 by zanyda           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |	ex03/						|
// | ------------------ | ------------------------------|
// | Files to turn in:	|	ft_rev_params.c				|
// | Allowed functions: |	ft_putchar     				|
// | Notes: 			|	n/a (без комментариев)		|
//
// 1. Здесь мы имеем дело с программой, поэтому в вашем .c-файле должна быть main функция.
//    > We’re dealing with a program here, you should therefore have a function main in your .c file.
// 2. Создайте программу, которая будет отображать заданные ею аргументы в обратном порядке.
//    > Create a program that displays its given arguments in reverse order.
// 3. Должны отображаться все аргументы, кроме argv[0].
//    > It should display all arguments, except for argv[0].
// 4. Каждый аргумент должен находиться на отдельной строчке.
//    > All arguments have to have their own line.

/* -------------------------------------------------------------------------- */
/* test                                                                       */
/* -------------------------------------------------------------------------- */
#include <unistd.h>

void ft_putchar(char c)
{
	write(1, &c, 1);
}

/* -------------------------------------------------------------------------- */
/* ft_rev_params                                                              */
/* -------------------------------------------------------------------------- */

//void	ft_putchar(char c);

void	ft_putstr(char *str)
{
	while (*str)
	{
		ft_putchar(*str);
		str++;
	}
}

int		main(int argc, char *argv[])
{
	int i;
	// нам нужно вывести все аргументы, кроме [0]. Нужно получить колл-во требуемых аргументов.
	// тоесть, если мы дадим 5 значений, то аргументов вместе взятых с названием программы будет 6.
	i = argc - 1;
	while (i >= 1)
	{
		ft_putstr(argv[i]);
		ft_putchar('\n');
		i--;
	}
	return (0);
}