/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zanyda <darrnokturna@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/08 03:17:27 by zanyda            #+#    #+#             */
/*   Updated: 2020/01/08 03:17:27 by zanyda           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex06/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_strlen.c                    |
// | Allowed functions: |      Nothing                        |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая будет считать и возвращать число символов в строке.
//
//    > Create a function that counts and returns the number of characters in a string.
//
// 2. Here’s how it should be prototyped: int ft_strlen(char *str);

#include <stdio.h>			 	// Для тестов и компиляции, чтобы использовать printf

//===========================//

int		ft_strlen(char *str)
{
	int	i;					// cоздаем переменную int i, в которую мы будем помещать символы

	i = 0;					// выделяем этой переменной область данных с 0, чтобы потом этот 0 заменить данными для *str
	while (str[i])			// Создаем цикл, где из *str мы будем помещать по 1 символу в int [i]
	{						//
		i++;				// i++ переходит на слеующий символ *str и добавляет его в [i] = 2
	}
	return (i);				// Возвращаем число, которое образовалось в процессе сложения.
}

// [i] = 0
// *str = "test"
// [i] + t = 1
// +
// [i] + e = 2
// +
// [i] + s = 3
// +
// [i] + t = 4
// =
// 4

//==========================//

int main()
{
	printf("test.1 - %d, test.2 - %d, test.3 - %d", ft_strlen("test"), ft_strlen(""), ft_strlen("test2"));

	return 0;
}