/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/15 16:04:03 by marvin            #+#    #+#             */
/*   Updated: 2020/01/15 16:04:03 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex05/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_strstr.c                    |
// | Allowed functions: |      Nothing                        |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Воссоздайте функционал функции strstr (man strstr).
//    > Reproduce the behavior of the function strstr (man strstr).
// 2. Here’s how it should be prototyped: char *ft_strstr(char *str, char *to_find);

/* -------------------------------------------------------------------------- */
/* material                                                                   */
/* -------------------------------------------------------------------------- */

// https://www.youtube.com/watch?v=NtYJ49ZsNhY
// В строке *str ищет подстроку *to_find и возвращает указатель на начало найденного совпадения, иначе NULL.

/* -------------------------------------------------------------------------- */
/* ft_strstr                                                                  */
/* -------------------------------------------------------------------------- */
char	*ft_strstr(char *str, char *to_find)
{
	int i;
	int j;

	if (to_find[0] == '\0')			// Если в 0 индексе to_find \0 (пусто)
	{
		return (str);				// То просто выводим *str
	}
	i = 0;
	while (str[i++] != '\0')			// Пока str[*] не является '\0'
	{
		j = 0;
		while (to_find[j] != '\0' && to_find[j] == str[i + j])
		{
			j++;
		}
		if (to_find[j] == '\0')
		{
			return (&str[i]);
		}
	}
	return (0);
}