/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/15 16:04:03 by marvin            #+#    #+#             */
/*   Updated: 2020/01/15 16:04:03 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex08/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_strupcase.c                 |
// | Allowed functions: |      Nothing                        |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая преобразует каждую букву каждого слова в заглавную букву.
//    > Create a function that transforms every letter of every word to uppercase.
// 2. Here’s how it should be prototyped: char *ft_strupcase(char *str);
// 3. It should return str.

/* -------------------------------------------------------------------------- */
/* Материал                                                                   */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* ft_strupcase                                                               */
/* -------------------------------------------------------------------------- */
char	*ft_strupcase(char *str)
{
	int i;

	i = 0;
	while (str[i] != '\0')
	{
		if (str[i] >= 'a' && str[i] <= 'z')
		{
			str[i] -= 32; // str[65].A = str[97].a - 32 согласно ASCII таблице.
		}
		i++;
	}
	return (str);
}