/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zanyda <darrnokturna@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/06 14:29:33 by zanyda            #+#    #+#             */
/*   Updated: 2020/01/06 14:29:33 by zanyda           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex02/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_print_numbers.c             |
// | Allowed functions: |      ft_putchar                     |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая будет отображать цифры, в одну строку, в порядке возрастнания.
//    > Create a function that displays all digits, on a single line, by ascending order.
// 2. Вот как должен выглядеть прототип: void ft_print_numbers(void);

/* -------------------------------------------------------------------------- */
/* ft_putchar                                                                 */
/* -------------------------------------------------------------------------- */

void    ft_putchar(char c)
{
	write(1, &c, 1);
}

/* -------------------------------------------------------------------------- */
/* ft_print_numbers                                                           */
/* -------------------------------------------------------------------------- */

void	ft_print_numbers(void)
{
	int n;

	n = 48;
	while (n <= 57)
	{
		ft_putchar(n);
		n++;
	}
}

/* -------------------------------------------------------------------------- */
/* main & test                                                                */
/* -------------------------------------------------------------------------- */

int main()
{
	ft_print_numbers();
	return (0);
}