/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zanyda <darrnokturna@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/08 03:17:27 by zanyda            #+#    #+#             */
/*   Updated: 2020/01/08 03:17:27 by zanyda           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex05/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_putstr.c                    |
// | Allowed functions: |      ft_putchar                     |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая будет выводить символьную строку.
//    > Create a function that displays a string of characters on the standard output.
// 2.  Here’s how it should be prototyped: void ft_putstr(char *str);

/* -------------------------------------------------------------------------- */
/* main & test                                                                */
/* -------------------------------------------------------------------------- */
#include <unistd.h>

void ft_putchar(char c)
{
	write(1, &c, 1);
}

/* -------------------------------------------------------------------------- */
/* ft_putstr                                                                  */
/* -------------------------------------------------------------------------- */
// Эта функция отображает строку *str в стандартный вывод. Мы делаем вывод используя
// нашу ft_putchar функцию. Мы начинаем с объявления переменной int i, через которую
// мы будем проводить нашу строку в вывод. Мы делаем i = 0, чтобы начать с начала
// параметра строки *str. Далее мы делаем простой цикл с перебором всего того,
// что находится внутри i++, до самого конца. Мы переходим к каждой позиции [индекса] нашей строки
// и помещаем символ в эту позицию в качестве параметра для нашей функции вывода ft_putchar.
// Функция ft_putchar поместит этот символ в стандартный вывод, а затем мы увеличим переменную i++,
// чтобы продолжить движение по строке. Мы делаем это, пока не достигнем конца "\0" строки.

void	ft_putstr(char *str)
{
	int	i;

	i = 0;
	while (str[i])
	{
		ft_putchar(str[i]);
		i++;
	}
}

/* -------------------------------------------------------------------------- */
/* main & test                                                                */
/* -------------------------------------------------------------------------- */
int main()
{
	ft_putstr("test");

	/* -------------------------------------------------------------------------- */
	/* verification                                                               */
	/* -------------------------------------------------------------------------- */
	printf("==== 00 ft_putstr ====\n");
	{
		printf("==== You should see on next line: '' ====\n");
		ft_putstr("");
		printf("\n");

		printf("You should see on next line: 'The meaning of life is 42.'\n");
		ft_putstr("The meaning of life is 42.");
		printf("\n");
	}
	/* -------------------------------------------------------------------------- */
	/* verification                                                               */
	/* -------------------------------------------------------------------------- */

	return 0;
}
//============================//

// i[1] = t
// +
// i[2] = e
// +
// i[3] = s
// +
// i[4] = t
// =
// test