/* ************************************************************************** */
/*																			  */
/*														  :::	   ::::::::   */
/*	 main.c 											:+: 	 :+:	:+:   */
/*													  +:+ +:+		  +:+	  */
/*	 By: marvin <marvin@student.42.fr>				+#+  +:+	   +#+		  */
/*												  +#+#+#+#+#+	+#+ 		  */
/*	 Created: 2020/01/18 05:30:17 by marvin 		   #+#	  #+#			  */
/*	 Updated: 2020/01/18 05:30:17 by marvin 		  ###	########.fr 	  */
/*																			  */
/* ************************************************************************** */

// | Turn-in directory: |	ex17/						|
// | ------------------ | ------------------------------|
// | Files to turn in:	|	ft_strncat.c				|
// | Allowed functions: |	Nothing						|
// | Notes: 			|	n/a (без комментариев)		|
//
// 1. Воссоздайте функционал функции strncat (man strncat).
//	  > Reproduce the behavior of the function strncat (man strncat).
// 2. Here’s how it should be prototyped: char *ft_strncat(char *dest, char *src, int nb);

/* -------------------------------------------------------------------------- */
/* Материал                                                                   */
/* -------------------------------------------------------------------------- */
// добавляет n символов из строки str в конец строки dest и возвращает указатель на результат.

/*
** Функция strncat() добавляет к строке, на которую указывает str1, не более
** count символов из строки, на которую указывает str2. В конце модифицированной
** строки str1 функция ставит нуле­вой символ. Нулевой символ, первоначально
** завершавший строку str1, замещается первым симво­лом строки str2. Строка str2
** остается в первоначальном виде.Функция strncat() возвращает указатель str1.
*/

/* -------------------------------------------------------------------------- */
/* ft_strncat                                                                 */
/* -------------------------------------------------------------------------- */
char	*ft_strncat(char *dest, char *src, int nb)
{
	int	i;
	int	j;

	i = 0;
	j = 0;
    while (dest[i] != '\0')
	{
		i++;
	}
	while (src[j] && j < nb)
	{
		dest[i] = src[j];
		i++;
		j++;
	}
	dest[i] = '\0';
	return (dest);
}