/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/15 16:05:27 by marvin            #+#    #+#             */
/*   Updated: 2020/01/15 16:05:27 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex03/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_strcpy.c                    |
// | Allowed functions: |      Nothing                        |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Воссоздайте функционал функции strcpy (man strcpy).
//    > Reproduce the behavior of the function strcpy (man strcpy).
// 2. Here’s how it should be prototyped: char *ft_strcpy(char *dest, char *src);

// Это функция, которая берет содержимое одной строки и копирует в другую. https://www.youtube.com/watch?v=qpOS372MxtY

/* -------------------------------------------------------------------------- */
/* ft_strcpy                                                                  */
/* -------------------------------------------------------------------------- */

char	*ft_strcpy(char *dest, char *src)
// char *dest - destination это строка назначения, а char *src - строка, откуда берутся символы
{
	int i;                  // Объявляем i

	i = 0;                  // Даем i адрес, чтобы в этот адрес поместить 0, теперь мы можем передвигаться по массивам
	while (src[i])          // src[i.0]
	{
		dest[i] = src[i];   // dest[i.0] = src[i.0] присваеиваем адрес 0 массива dest, адресу 0 массива src
		i++;             // Переходим к следующему адресу i.1
	}
	dest[i] = '\0';         // через цикл почемеу-то не получается вставить терм.0, поэтому мы просто приравниваем dest[i.6] = '\0' тем самым делаем конец строки
	return (dest);
}

/* -------------------------------------------------------------------------- */
/* main & test                                                                */
/* -------------------------------------------------------------------------- */

int   main(void)
{
    char src[]  = {"Plutot sympa"};                 // Отсюда берем
    char dest[] = {"La programation c'est cool"};   // Сюда вставляем

	ft_strcpy(dest, src);
	printf("%s\n", dest);

	return (0);
}