/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zanyda <darrnokturna@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/06 14:29:33 by zanyda            #+#    #+#             */
/*   Updated: 2020/01/06 14:29:33 by zanyda           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex01/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_print_reverse_alphabet.c    |
// | Allowed functions: |      ft_putchar                     |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая будет выводить алфовит с маленькой буквы, в одну строку, в порядке убывания, начиная с буквы 'z'.
//    > Create a function that displays the alphabet in lowercase, on a single line, by descending order, starting from the letter ’z’.
// 2. Вот как должен выглядеть прототип: void ft_print_reverse_alphabet(void);

/* -------------------------------------------------------------------------- */
/* ft_putchar                                                                 */
/* -------------------------------------------------------------------------- */

void    ft_putchar(char c)
{
	write(1, &c, 1);
}

/* -------------------------------------------------------------------------- */
/* ft_print_reverse_alphabet                                                  */
/* -------------------------------------------------------------------------- */

void	ft_print_reverse_alphabet(void)
{
	int z;

	z = 122;
	// Цикл: пока (z / 97) будет больше или будет равен (122) выполняем тело цикла
	while (z >= 97)
	{
		ft_putchar(z);
		// Выводить (z) как? (z/122) = (122) - 1 (В порядке убывания)
		z--;
	}
}

/* -------------------------------------------------------------------------- */
/* main & test                                                                */
/* -------------------------------------------------------------------------- */

int main()
{
	ft_print_reverse_alphabet();
	return (0);
}