/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zanyda <darrnokturna@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/06 14:29:33 by zanyda            #+#    #+#             */
/*   Updated: 2020/01/06 14:29:33 by zanyda           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex03/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_is_negative.c               |
// | Allowed functions: |      ft_putchar                     |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая будет выводить 'N' или 'P' в зависимости от введенного целочисленного числа в параметр этой функции. Если n является отрицательным числом, то будет выведено 'N'. Если положительным или нулем, то выведется 'P'.
//    > Create a function that displays ’N’ or ’P’ depending on the integer’s sign enteredas a parameter. If n is negative, display ’N’. If n is positive or null, display ’P’.
// 2. Вот как должен выглядеть прототип: void ft_is_negative(int n);

/* -------------------------------------------------------------------------- */
/* ft_putchar                                                                 */
/* -------------------------------------------------------------------------- */

void    ft_putchar(char c)
{
	write(1, &c, 1);
}

/* -------------------------------------------------------------------------- */
/* ft_is_negative                                                             */
/* -------------------------------------------------------------------------- */

void	ft_is_negative(int n)
{
	if (n < 0)
	{
		ft_putchar('N');
	}
	else if (n >= 0)
	{
		ft_putchar('P');
	}
}

/* -------------------------------------------------------------------------- */
/* main & test                                                                */
/* -------------------------------------------------------------------------- */

int main()
{
    ft_is_negative(100);
    ft_is_negative(-1);
    ft_is_negative(0);
    ft_is_negative(100);
    ft_is_negative(-100);
    return(0);
}