/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zanyda <darrnokturna@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/06 14:29:33 by zanyda            #+#    #+#             */
/*   Updated: 2020/01/06 14:29:33 by zanyda           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex06/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_putnbr.c                    |
// | Allowed functions: |      ft_putchar                     |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая выводит введенный номер, в параметр этой функции. Функция должна иметь возможность отображать все возможные значения внутри переменной типа int.
//    > Create a function that displays the number entered as a parameter. The function has to be able to display all possible values within an int type variable.
// 2. Here’s how it should be prototyped: void ft_putnbr(int nb);
// 3. Для примера: ft_putnbr(42) выведет "42". // For example: ft_putnbr(42) displays "42".

/* -------------------------------------------------------------------------- */
/* ft_putchar                                                                 */
/* -------------------------------------------------------------------------- */
#include <unistd.h>
#include <stdio.h>

void ft_putchar(char c)
{
	write(1, &c, 1);
}

/* -------------------------------------------------------------------------- */
/* ft_putnbr                                                                  */
/* -------------------------------------------------------------------------- */
void	ft_putnbr(int nb)
{
    if (nb < 0)
    {
        ft_putchar('-');
        if (nb == -2147483648)
            {
                ft_putchar('2');
                ft_putnbr(147483648);
                return;
            }
        ft_putnbr(-nb);
    }
	else if (nb < 10)
	{
		ft_putchar(nb + '0');
	}
	else
	{
        ft_putnbr(nb / 10);
        ft_putnbr(nb % 10);
	}
}

/* -------------------------------------------------------------------------- */
/* main & test                                                                */
/* -------------------------------------------------------------------------- */

int main()
{
	/* -------------------------------------------------------------------------- */
	/* verification                                                               */
	/* -------------------------------------------------------------------------- */
    printf("==== ex06 ft_putnbr ====\n");
	{
		printf("==== Putting: '-100' ====\n");
		ft_putnbr(-100);
		printf("\n");

		printf("==== Putting: '0' ====\n");
		ft_putnbr(0);
		printf("\n");

		printf("==== Putting: '123 ===='\n");
		ft_putnbr(123);
		printf("\n");

		printf("==== Putting: INT_MAX '2147483647' ====\n");
		ft_putnbr(2147483647);
		printf("\n");

		printf("==== Putting: INT_MIN '-2147483648' ====\n");
		ft_putnbr(-2147483648);
		printf("\n");
	}
	/* -------------------------------------------------------------------------- */
	/*                                                                            */
	/* -------------------------------------------------------------------------- */

	return(0);
}