/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/14 19:30:39 by marvin            #+#    #+#             */
/*   Updated: 2020/01/14 19:30:39 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex00/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_putstr.c                    |
// | Allowed functions: |      ft_putchar                     |
// | Notes:             |      n/a (без комментариев)         |
//
// 42 - Classics: Эти упражнения являются ключевыми заданиями, которые не приносят очков, но обязательны для проверки, чтобы получить доступ к реальным заданиям дня.
//                Видимо peer'ы будут меня проверять, как хорошо я понял материал прошлой недели. Ну лааааааадно.
//                Theses exercises are key assignments that do not earn points, but are mandatory to validate in order to access to the real assignments of the day.

// day05/ex00 <=> day03/ex05