/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/15 16:04:03 by marvin            #+#    #+#             */
/*   Updated: 2020/01/15 16:04:03 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// | Turn-in directory: |      ex12/                          |
// | ------------------ | ----------------------------------- |
// | Files to turn in:  |      ft_str_is_numeric.c            |
// | Allowed functions: |      Nothing                        |
// | Notes:             |      n/a (без комментариев)         |
//
// 1. Создайте функцию, которая возвращает 1, если строка, заданная в качестве параметра, содержит только цифры, и 0, если она содержит любой другой символ.
//    > Create a function that returns 1 if the string given as a parameter contains only digits, and 0 if it contains any other character.
// 2. Here’s how it should be prototyped: int ft_str_is_numeric(char *str);
// 3. Она должна вернуть 1, если строка пустая. It should return 1 if str is empty.

/* -------------------------------------------------------------------------- */
/* Материал                                                                   */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* ft_str_is_numeric                                                          */
/* -------------------------------------------------------------------------- */
int		ft_str_is_numeric(char *str)
{
	int i;

	i = 0;
	while (str[i] != '\0')
	{
		if (!(str[i] >= '0' && str[i] <= '9')) 	// если текущий символ не является цифрой из данного диапазона
		{
			return (0);							// то return 0
		}
		i++;									// едем дальше
	}
	return (1);									// если цикл прошел успешно и в строке только цифры, то return 1
}