/* ************************************************************************** */
/*																			  */
/*														  :::	   ::::::::   */
/*	 main.c 											:+: 	 :+:	:+:   */
/*													  +:+ +:+		  +:+	  */
/*	 By: marvin <marvin@student.42.fr>				+#+  +:+	   +#+		  */
/*												  +#+#+#+#+#+	+#+ 		  */
/*	 Created: 2020/01/18 05:30:17 by marvin 		   #+#	  #+#			  */
/*	 Updated: 2020/01/18 05:30:17 by marvin 		  ###	########.fr 	  */
/*																			  */
/* ************************************************************************** */

// | Turn-in directory: |	   ex16/						  |
// | ------------------ | ----------------------------------- |
// | Files to turn in:	|	   ft_strcat.c					  |
// | Allowed functions: |	   Nothing						  |
// | Notes: 			|	   n/a (без комментариев)		  |
//
// 1. Воссоздайте функционал функции strcat (man strcat).
//	  > Reproduce the behavior of the function strcat (man strcat).
// 2. Here’s how it should be prototyped: char *ft_strcat(char *dest, char *src);

/* -------------------------------------------------------------------------- */
/* Материал 																  */
/* -------------------------------------------------------------------------- */
// char *ft_strcat(char *dest, char *str)
// добавляет строку str в конец строки dest и возвращает указатель на результат.
// Конкатенирует строку src к строке dest

/*
** Объединение строк. Функция добавляет копию строки src-ptr в конец строки
** dest-ptr. Нулевой символ конца строки dest-ptr заменяется первым символом
** строки src-ptr, и новый нуль-символ добавляется в конец уже новой строки,
** сформированной объединением символов двух строк в строке dest-ptr.
*/

//include "ft_strcat.c"

/* -------------------------------------------------------------------------- */
/* ft_strcat																  */
/* -------------------------------------------------------------------------- */
char *ft_strcat(char *dest, char *src)
{
	int i;
	int j;

	i = 0;
	j = 0;
	while (dest[i] != '\0')
	{
		i++;
	}
	while (src[j] != '\0')
	{
		dest[i] = src[j];
		j++;
		i++;
	}
	dest[i] = '\0';
	return (dest);
}